 /*
 * MAIN Generated Driver File
 * 
 * @file main.c
 * 
 * @defgroup main MAIN
 * 
 * @brief This is the generated driver implementation file for the MAIN driver.
 *
 * @version MAIN Driver Version 1.0.2
 *
 * @version Package Version: 3.1.2
*/

/*
© [2026] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

/* Include -------------------------------------------------------------------*/
#include "mcc_generated_files/system/system.h"
#include "header/timer0.h"
#include "header/timer1.h"
#include "header/timer2.h"
#include "header/usart.h"
#include "header/usart1.h"
#include "header/modbus.h"
#include <stdint.h>
/* END Include ---------------------------------------------------------------*/

/* typedef -------------------------------------------------------------------*/
/*
	Union para transformacion de tipos de datos
*/
typedef union{
	uint32_t u32;
	uint16_t ui16[2];
	uint8_t ui8[4];
}_uWord;

_uWord myWord;

/*	
	Mapa de banderas para el manejo del baudrate USART1 
	
*/ 
typedef union{
	struct{
		uint8_t BR9600 : 1;
		uint8_t RESERVED : 7;
	} iFlags;
	uint8_t aFlags_TIM2;
}_uFlags_TIM2;
_uFlags_TIM2 TIM2_BR;

/*
	Mapa de banderas para manejo de lectura de entradas digitales
*/
typedef union{
	struct{
		uint8_t isEvent1 : 1;
		uint8_t isEvent2 : 1;
		uint8_t isEvent3 : 1;
		uint8_t isEvent4 : 1;
		uint8_t RESERVED : 4;
	} iFlags;
	uint8_t aFlags_input;
}_uFlags_input;

_uFlags_input inputFlags;

typedef struct {
	uint32_t unixTime;				//0x400 0x401 0x402 0x403
	uint8_t brConfig;				//0x404
	uint8_t parity;					//0x405
	uint16_t timeBtw[4];			//0x406 0x407 x0408 0x409 0x40A x40B x40C x40D 
	uint16_t idCounter[4];			//0x40E 0x41F x0410 0x411 0x412 x413 x414 x415 
	uint16_t diagnosticsRegister;	//0x416 x417
	uint16_t newEventCounter;		//0x418 x419
	uint16_t eventIndexR;			//0x41A x41B
} _sModbusReg;

/*
Estructura de Evento
* ID			: Numero de entrada
* stateLastEvent: Estado de la entrada leida
* timeLastEvent	: Tiempo del evento en formato unix
*/
typedef struct {
	uint8_t  ID;
	uint8_t  stateLastEvent;
	uint32_t timeLastEvent;
}_sEvent __attribute__((aligned(1)));

/*
* Start Address:	0x01
* End Address:		0x0B
* Total Bytes:		0x0B
*/
typedef enum{
	SLAVE_EEPROM_ADDRESS = 1,
	BRCONFIG_EEPROM_ADDRESS,
	PARITY_EEPROM_ADDRESS,
	TIMEBTW0_LOW_EEPROM_ADDRESS,
	TIMEBTW0_HIGH_EEPROM_ADDRESS,
	TIMEBTW1_LOW_EEPROM_ADDRESS,
	TIMEBTW1_HIGH_EEPROM_ADDRESS,
	TIMEBTW2_LOW_EEPROM_ADDRESS,
	TIMEBTW2_HIGH_EEPROM_ADDRESS,
	TIMEBTW3_LOW_EEPROM_ADDRESS,
	TIMEBTW3_HIGH_EEPROM_ADDRESS,
}_eEEPROM_Address;
/* END typedef ---------------------------------------------------------------*/

/* Define --------------------------------------------------------------------*/
